Tekla Open API Reference for Tekla Structures 2025
IEvents.OnViewClosed Method
 Called when a view is closed.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void OnViewClosed(
	int viewId
)
Sub OnViewClosed (
	viewId As Integer
)
Parameters
viewId
Type: System.Int32
[Missing <param name="viewId"/> documentation for "M:Tekla.Structures.Model.IEvents.OnViewClosed(System.Int32)"]
See Also
Reference
IEvents Interface
Tekla.Structures.Model Namespace